; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 7207)
	(= (fuel plane1) 281)
	(= (slow-burn plane1) 3)
	(= (fast-burn plane1) 8)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 3)
	(at person1 city0)
	(at person2 city3)
	(at person3 city1)
	(at person4 city1)
	(at person5 city1)
	(at person6 city2)
	(at person7 city0)
	(at person8 city1)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 744)
	(= (distance city0 city2) 575)
	(= (distance city0 city3) 625)
	(= (distance city1 city0) 744)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 710)
	(= (distance city1 city3) 775)
	(= (distance city2 city0) 575)
	(= (distance city2 city1) 710)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 881)
	(= (distance city3 city0) 625)
	(= (distance city3 city1) 775)
	(= (distance city3 city2) 881)
	(= (distance city3 city3) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at person1 city1)
	(at person2 city3)
	(at person3 city3)
	(at person4 city1)
	(at person5 city0)
	(at person6 city1)
	(at person7 city0)
	(at person8 city2)
	))

(:metric minimize (+ (* 5 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 3 of 8
2. (refuel plane1 city0)
   changed: (fuel plane1) from 281 to 7207
   goals met: 3 of 8
3. (fly plane1 city0 city1)
   deleted: (at plane1 city0)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 0 to 2232, (fuel plane1) from 7207 to 4975
   goals met: 3 of 8
4. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 4 of 8
5. (board person3 plane1 city1)
   deleted: (at person3 city1)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 8
6. (board person5 plane1 city1)
   deleted: (at person5 city1)
   added: (in person5 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 4 of 8
7. (board person8 plane1 city1)
   deleted: (at person8 city1)
   added: (in person8 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 4 of 8
8. (fly plane1 city1 city3)
   deleted: (at plane1 city1)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 2232 to 4557, (fuel plane1) from 4975 to 2650
   goals met: 4 of 8
9. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   changed: (onboard plane1) from 3 to 2
   goals met: 5 of 8
10. (fly plane1 city3 city0)
   deleted: (at plane1 city3)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 4557 to 6432, (fuel plane1) from 2650 to 775
   goals met: 5 of 8
11. (debark person5 plane1 city0)
   deleted: (in person5 plane1)
   added: (at person5 city0)
   changed: (onboard plane1) from 2 to 1
   goals met: 6 of 8
12. (refuel plane1 city0)
   changed: (fuel plane1) from 775 to 7207
   goals met: 6 of 8
13. (fly plane1 city0 city2)
   deleted: (at plane1 city0)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 6432 to 8157, (fuel plane1) from 7207 to 5482
   goals met: 6 of 8
14. (debark person8 plane1 city2)
   deleted: (in person8 plane1)
   added: (at person8 city2)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 8
15. (board person6 plane1 city2)
   deleted: (at person6 city2)
   added: (in person6 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 7 of 8
16. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 8157 to 10287, (fuel plane1) from 5482 to 3352
   goals met: 7 of 8
17. (debark person6 plane1 city1)
   deleted: (in person6 plane1)
   added: (at person6 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 8 of 8
